# Задание №12 #
1. Взять 4-5 популярных туроператора.
2. Каждый туроператор должен быть представлен в виде ноды neo4j
3. Взять 10-15 направлений, в которые данные операторы предоставляют путевки.
4. Представить направления в виде связки нод: страна - конкретное место
5. Взять ближайшие к туриситическим локациям города, в которых есть аэропорты или вокзалы и представить их в виде нод
6. Представить маршруты между городaми в виде связей. Каждый маршрут должен быть охарактеризован видом транспорта, который позволяет переместиться между точками.
7. Написать запрос, который бы выводил направление (со всеми промежуточными точками), который можно осуществить только наземным транспортом.
8. Составить план запроса из пункта 7.
9. Добавить индексы для оптимизации запроса
10. Еще раз посмотреть план запроса и убедиться, что индексы позволили оптимизировать запрос

# Решение #

Для выполнения данного задания будет использоваться ВМ с предыдущего задания.

1. Выбраны популярные туроператоры за 2023 год:
   * Pegas Touristik
   * НТК Интурист
   * Библио Глобус
   * Anex Tour
   * Sunmar
2. Представлены в виде отдельных нод:
```
create (Pegas:TourOperator {name:'Pegas Touristik'})
create (НТК:TourOperator {name:'НТК Интурист'})
create (Библио:TourOperator {name:'Библио Глобус'})
create (Anex:TourOperator {name:'Anex Tour'})
create (Sunmar:TourOperator {name:'Sunmar'})
```
3. Взяты 3 страны с наибольшим количеством направлений от данных туроператоров:
   * Турция - 4 туроператора
   * Египет - 4 туроператора
   * ОАЭ - 2 туроператора
```
create (Turkey:Country {name:'Turkey'})
CREATE
(Pegas)-[:Tour]->(Turkey),
(Библио)-[:Tour]->(Turkey),
(Anex)-[:Tour]->(Turkey),
(Sunmar)-[:Tour]->(Turkey)

create (Egypt:Country {name:'Egypt'})
CREATE
(Pegas)-[:Tour]->(Egypt),
(НТК)-[:Tour]->(Egypt),
(Библио)-[:Tour]->(Egypt),
(Anex)-[:Tour]->(Egypt)

create (UAE:Country {name:'UAE'})
CREATE
(Библио)-[:Tour]->(UAE),
(Anex)-[:Tour]->(UAE)
```
4. В каждой стране есть аэропорты куда туроператоры доставляют туристов, представлены в виде Страна-Город:
```
// Турция
create (Antalya:City {name:'Antalya'})
create (Alanya:City {name:'Alanya'})
CREATE
(Turkey)-[:Place]->(Alanya),
(Turkey)-[:Place]->(Antalya)

// Египет
create (Hurghada:City {name:'Hurghada'})
create (Marsa:City {name:'Marsa Alam'})
create (Sharm:City {name:'Sharm Al Shiekh'})
CREATE
(Egypt)-[:Place]->(Hurghada),
(Egypt)-[:Place]->(Marsa),
(Egypt)-[:Place]->(Sharm)

// ОАЭ
create (Abu:City {name:'Abu Dhabi'})
create (Dubai:City {name:'Dubai'})
create (Fujairah:City {name:'Fujairah'})
CREATE
(UAE)-[:Place]->(Abu),
(UAE)-[:Place]->(Dubai),
(UAE)-[:Place]->(Fujairah)
```
5. Также в 3 странах были взяты города до которых можно добраться только наземным транспортом:
```
// Турция
create (Belek:City {name:'Belek'})
create (Side:City {name:'Side'})
create (Marmaris:City {name:'Marmaris'})

// Египет
create (Dahab:City {name:'Dahab'})
create (Nuweiba:City {name:'Nuweiba'})
create (Berenice:City {name:'Berenice'})
create (Ghalib:City {name:'Ghalib'})
create (Barramiya:City {name:'Barramiya'})
create (Kena:City {name:'Kena'})
create (Jemsa:City {name:'Jemsa'})
// ОАЭ
create (Abu:City {name:'Abu Dhabi'})
create (Dubai:City {name:'Dubai'})
create (Fujairah:City {name:'Fujairah'})
```
6. В представлении связей использовал еще города которые имееют аэропорты, так как между ними можно передвигаться воздушным или наземным транспортом:
```
// Турция
CREATE
(Antalya)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Alanya),

(Alanya)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Antalya),

(Antalya)-[:Transport {Ground:['Avto, Train']}]->(Belek),
(Antalya)-[:Transport {Ground:['Avto, Train']}]->(Side),
(Antalya)-[:Transport {Ground:['Avto, Train']}]->(Marmaris),

(Alanya)-[:Transport {Ground:['Avto, Train']}]->(Belek),
(Alanya)-[:Transport {Ground:['Avto, Train']}]->(Side),
(Alanya)-[:Transport {Ground:['Avto, Train']}]->(Marmaris)

// Египет
CREATE
(Hurghada)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Marsa),
(Hurghada)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Sharm),

(Marsa)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Hurghada),
(Marsa)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Sharm),

(Sharm)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Hurghada),
(Sharm)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Marsa),

(Sharm)-[:Transport {Ground:['Avto, Train']}]->(Dahab),
(Sharm)-[:Transport {Ground:['Avto, Train']}]->(Nuweiba),

(Marsa)-[:Transport {Ground:['Avto, Train']}]->(Berenice),
(Marsa)-[:Transport {Ground:['Avto, Train']}]->(Ghalib),
(Marsa)-[:Transport {Ground:['Avto, Train']}]->(Barramiya),

(Hurghada)-[:Transport {Ground:['Avto, Train']}]->(Kena),
(Hurghada)-[:Transport {Ground:['Avto, Train']}]->(Jemsa)

// ОАЭ

(Abu)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Dubai),
(Abu)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Fujairah),

(Dubai)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Abu),
(Dubai)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Fujairah),

(Fujairah)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Abu),
(Fujairah)-[:Transport {Air:['Plane'], Ground:['Avto, Train']}]->(Dubai),

(Abu)-[:Transport {Ground:['Avto, Train']}]->(Milehah),
(Abu)-[:Transport {Ground:['Avto, Train']}]->(Shawka),
(Abu)-[:Transport {Ground:['Avto, Train']}]->(Sweihan),

(Dubai)-[:Transport {Ground:['Avto, Train']}]->(Milehah),
(Dubai)-[:Transport {Ground:['Avto, Train']}]->(Shawka),
(Dubai)-[:Transport {Ground:['Avto, Train']}]->(Sweihan),

(Fujairah)-[:Transport {Ground:['Avto, Train']}]->(Milehah),
(Fujairah)-[:Transport {Ground:['Avto, Train']}]->(Shawka),
(Fujairah)-[:Transport {Ground:['Avto, Train']}]->(Sweihan)
```
![connect](https://github.com/dushaev7777/NoSQL1989-02-24/blob/main/Image/DZ12/DZ12.png)

Некоторые города для наземного транспорта имеют несколько связей, так как находятся почти на равном расстоянии от выбранных городов с аэропортами.

7. Составим запрос в котором будут отображаться города в которые можно добраться наземным танспортом:
```
MATCH (a:City)-[r:Transport]-(b:City)
WHERE (r.Ground) IS NOT NULL AND (r.Air) IS NULL
RETURN a,r,b
```
![connect](https://github.com/dushaev7777/NoSQL1989-02-24/blob/main/Image/DZ12/DZ12_1.png)
```
╒═════════════════════════════════╤══════════════════════════════════════╤═════════════════════════════════╕
│a                                │r                                     │b                                │
╞═════════════════════════════════╪══════════════════════════════════════╪═════════════════════════════════╡
│(:City {name: "Marsa Alam"})     │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Barramiya"})      │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Hurghada"})       │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Kena"})           │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Hurghada"})       │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Jemsa"})          │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Milehah"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Abu Dhabi"})      │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Shawka"})         │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Abu Dhabi"})      │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Sweihan"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Abu Dhabi"})      │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Milehah"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Dubai"})          │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Shawka"})         │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Dubai"})          │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Sweihan"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Dubai"})          │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Milehah"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Fujairah"})       │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Sweihan"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Fujairah"})       │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Shawka"})         │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Fujairah"})       │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Dubai"})          │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Milehah"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Abu Dhabi"})      │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Milehah"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Fujairah"})       │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Milehah"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Dubai"})          │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Shawka"})         │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Abu Dhabi"})      │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Shawka"})         │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Fujairah"})       │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Shawka"})         │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Dubai"})          │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Sweihan"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Fujairah"})       │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Sweihan"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Abu Dhabi"})      │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Sweihan"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Side"})           │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Antalya"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Belek"})          │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Antalya"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Marmaris"})       │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Antalya"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Marmaris"})       │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Alanya"})         │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Belek"})          │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Alanya"})         │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Side"})           │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Alanya"})         │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Antalya"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Belek"})          │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Alanya"})         │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Belek"})          │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Antalya"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Side"})           │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Alanya"})         │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Side"})           │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Alanya"})         │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Marmaris"})       │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Antalya"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Marmaris"})       │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Kena"})           │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Hurghada"})       │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Jemsa"})          │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Hurghada"})       │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Ghalib"})         │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Marsa Alam"})     │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Berenice"})       │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Marsa Alam"})     │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Barramiya"})      │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Marsa Alam"})     │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Nuweiba"})        │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Sharm Al Shiekh"})│
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Dahab"})          │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Sharm Al Shiekh"})│
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Sharm Al Shiekh"})│[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Dahab"})          │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Sharm Al Shiekh"})│[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Nuweiba"})        │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Marsa Alam"})     │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Berenice"})       │
├─────────────────────────────────┼──────────────────────────────────────┼─────────────────────────────────┤
│(:City {name: "Marsa Alam"})     │[:Transport {Ground: ["Avto, Train"]}]│(:City {name: "Ghalib"})         │
└─────────────────────────────────┴──────────────────────────────────────┴─────────────────────────────────┘
```
8. Составим план запроса:
```
PROFILE MATCH (a:City)-[r:Transport]-(b:City)
WHERE (r.Ground) IS NOT NULL AND (r.Air) IS NULL
RETURN a,r,b
```
![connect](https://github.com/dushaev7777/NoSQL1989-02-24/blob/main/Image/DZ12/DZ12_2.png)
```
Cypher version: , planner: COST, runtime: SLOTTED. 612 total db hits in 45 ms
```
9. Создадим индекс отношений для свойства Ground:
```
CREATE INDEX rel_range_index_name FOR ()-[r:Transport]-() ON (r.Ground)
```
10. Сделаем повторный запрос и сравним результаты:

![connect](https://github.com/dushaev7777/NoSQL1989-02-24/blob/main/Image/DZ12/DZ12_3.png)
```
Cypher version: , planner: COST, runtime: SLOTTED. 461 total db hits in 28 ms.

```
Из результатов видно что индекс ускорил скорость выполнения запроса почти в два раза.